# _*_coding:utf-8_*_
# __author: guo
import re

prescription = """明目护肝
茵陈 30 枸杞12  沙棘 15 姜黄 5 枳椇子 10 葛花8  菊花8  麦冬 6 大枣10  
失眠
桂圆20  莲子6  枸杞3   生地20   五味子10  
山楂5   炒枣仁5   蒲公英5  炒制陈皮2  
提升男性功能
肉苁蓉 15  生地10  苏叶10   桃仁5  陈皮5       桂圆肉15   薏苡仁20  小茴香籽5   公丁香1  
山药15   桑葚15  覆盆子10  蒲公英10    枸杞10
气血双补
龙眼肉20   黄芪15  当归15  西洋参5  阿胶0.1  
玫瑰花5克  枸杞5    大枣5   浮小麦5   甘草5 
"""

prescription = """明目护肝
茵陈:30克;枸杞:12克;沙棘:15克;姜黄:5克;枳椇子:10克;葛花:8克;菊花:8克;麦冬:6克;大枣:10克。
失眠
桂圆:20克;莲子:6克;枸杞:3克;生地:20克;五味子:10克;山楂:5克;炒枣仁:5克;蒲公英:5克;炒制陈皮:2克。
提升男性功能
肉苁蓉:15克;生地:10克;苏叶:10克;桃仁:5克;陈皮:5克;桂圆肉:15克;薏苡仁:20克;小茴香籽:5克;公丁香:1克;山药:15克;桑葚:15克;覆盆子:10克;蒲公英:10克;枸杞:10克。
气血双补
龙眼肉:20克;黄芪:15克;当归:15克;西洋参:5克;阿胶:0.1克;玫瑰花:5克;克  枸杞:5克;大枣:5克;浮小麦:5克;甘草:5克。 
"""


def norm(line):
    result = []
    for name, num in re.findall(r"(.*?)([\d.]+)", line):
        result.append(f"{name.strip()}:{num.strip()}克")
    return ";".join(result) + "。"


if __name__ == '__main__':
    print(norm("龙眼肉20   黄芪15  当归15  西洋参5  阿胶0.1  玫瑰花5克  枸杞5    大枣5   浮小麦5   甘草5 "))
